espressif/esp-idf/components/soc/esp32p4/include/soc/rtcadc_reg.h
/** RTCADC_INT_CLR_REG register
 *  Interrupt clear registers.
 */
#define RTCADC_INT_CLR_REG (DR_REG_LP_ADC_BASE + 0x54)
/** RTCADC_COCPU_SARADC1_INT_CLR : WT; bitpos: [0]; default: 0;
 *  ADC1 Conversion is done, int clear.
 */
#define RTCADC_COCPU_SARADC1_INT_CLR    (BIT(0))
#define RTCADC_COCPU_SARADC1_INT_CLR_M  (RTCADC_COCPU_SARADC1_INT_CLR_V << RTCADC_COCPU_SARADC1_INT_CLR_S)
#define RTCADC_COCPU_SARADC1_INT_CLR_V  0x00000001U
#define RTCADC_COCPU_SARADC1_INT_CLR_S  0
/** RTCADC_COCPU_SARADC2_INT_CLR : WT; bitpos: [1]; default: 0;
 *  ADC2 Conversion is done, int clear.
 */
#define RTCADC_COCPU_SARADC2_INT_CLR    (BIT(1))
#define RTCADC_COCPU_SARADC2_INT_CLR_M  (RTCADC_COCPU_SARADC2_INT_CLR_V << RTCADC_COCPU_SARADC2_INT_CLR_S)
#define RTCADC_COCPU_SARADC2_INT_CLR_V  0x00000001U
#define RTCADC_COCPU_SARADC2_INT_CLR_S  1
/** RTCADC_COCPU_SARADC1_ERROR_INT_CLR : WT; bitpos: [2]; default: 0;
 *  An errro occurs from ADC1, int clear.
 */
#define RTCADC_COCPU_SARADC1_ERROR_INT_CLR    (BIT(2))
#define RTCADC_COCPU_SARADC1_ERROR_INT_CLR_M  (RTCADC_COCPU_SARADC1_ERROR_INT_CLR_V << RTCADC_COCPU_SARADC1_ERROR_INT_CLR_S)
#define RTCADC_COCPU_SARADC1_ERROR_INT_CLR_V  0x00000001U
#define RTCADC_COCPU_SARADC1_ERROR_INT_CLR_S  2
/** RTCADC_COCPU_SARADC2_ERROR_INT_CLR : WT; bitpos: [3]; default: 0;
 *  An errro occurs from ADC2, int clear.
 */
#define RTCADC_COCPU_SARADC2_ERROR_INT_CLR    (BIT(3))
#define RTCADC_COCPU_SARADC2_ERROR_INT_CLR_M  (RTCADC_COCPU_SARADC2_ERROR_INT_CLR_V << RTCADC_COCPU_SARADC2_ERROR_INT_CLR_S)
#define RTCADC_COCPU_SARADC2_ERROR_INT_CLR_V  0x00000001U
#define RTCADC_COCPU_SARADC2_ERROR_INT_CLR_S  3
/** RTCADC_COCPU_SARADC1_WAKE_INT_CLR : WT; bitpos: [4]; default: 0;
 *  A wakeup event is triggered from ADC1, int clear.
 */
#define RTCADC_COCPU_SARADC1_WAKE_INT_CLR    (BIT(4))
#define RTCADC_COCPU_SARADC1_WAKE_INT_CLR_M  (RTCADC_COCPU_SARADC1_WAKE_INT_CLR_V << RTCADC_COCPU_SARADC1_WAKE_INT_CLR_S)
#define RTCADC_COCPU_SARADC1_WAKE_INT_CLR_V  0x00000001U
#define RTCADC_COCPU_SARADC1_WAKE_INT_CLR_S  4
/** RTCADC_COCPU_SARADC2_WAKE_INT_CLR : WT; bitpos: [5]; default: 0;
 *  A wakeup event is triggered from ADC2, int clear.
 */
#define RTCADC_COCPU_SARADC2_WAKE_INT_CLR    (BIT(5))
#define RTCADC_COCPU_SARADC2_WAKE_INT_CLR_M  (RTCADC_COCPU_SARADC2_WAKE_INT_CLR_V << RTCADC_COCPU_SARADC2_WAKE_INT_CLR_S)
#define RTCADC_COCPU_SARADC2_WAKE_INT_CLR_V  0x00000001U
#define RTCADC_COCPU_SARADC2_WAKE_INT_CLR_S  5

/** RTCADC_INT_ENA_W1TS_REG register
 *  Interrupt enable assert registers.
 */
#define RTCADC_INT_ENA_W1TS_REG (DR_REG_LP_ADC_BASE + 0x58)
/** RTCADC_COCPU_SARADC1_INT_ENA_W1TS : WT; bitpos: [0]; default: 0;
 *  ADC1 Conversion is done, write 1 to assert int enable.
 */
#define RTCADC_COCPU_SARADC1_INT_ENA_W1TS    (BIT(0))
#define RTCADC_COCPU_SARADC1_INT_ENA_W1TS_M  (RTCADC_COCPU_SARADC1_INT_ENA_W1TS_V << RTCADC_COCPU_SARADC1_INT_ENA_W1TS_S)
#define RTCADC_COCPU_SARADC1_INT_ENA_W1TS_V  0x00000001U
#define RTCADC_COCPU_SARADC1_INT_ENA_W1TS_S  0
/** RTCADC_COCPU_SARADC2_INT_ENA_W1TS : WT; bitpos: [1]; default: 0;
 *  ADC2 Conversion is done, write 1 to assert int enable.
 */
#define RTCADC_COCPU_SARADC2_INT_ENA_W1TS    (BIT(1))
#define RTCADC_COCPU_SARADC2_INT_ENA_W1TS_M  (RTCADC_COCPU_SARADC2_INT_ENA_W1TS_V << RTCADC_COCPU_SARADC2_INT_ENA_W1TS_S)
#define RTCADC_COCPU_SARADC2_INT_ENA_W1TS_V  0x00000001U
#define RTCADC_COCPU_SARADC2_INT_ENA_W1TS_S  1
/** RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TS : WT; bitpos: [2]; default: 0;
 *  An errro occurs from ADC1, write 1 to assert int enable.
 */
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TS    (BIT(2))
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TS_M  (RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TS_V << RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TS_S)
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TS_V  0x00000001U
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TS_S  2
/** RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TS : WT; bitpos: [3]; default: 0;
 *  An errro occurs from ADC2, write 1 to assert int enable.
 */
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TS    (BIT(3))
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TS_M  (RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TS_V << RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TS_S)
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TS_V  0x00000001U
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TS_S  3
/** RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TS : WT; bitpos: [4]; default: 0;
 *  A wakeup event is triggered from ADC1, write 1 to assert int enable.
 */
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TS    (BIT(4))
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TS_M  (RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TS_V << RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TS_S)
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TS_V  0x00000001U
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TS_S  4
/** RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TS : WT; bitpos: [5]; default: 0;
 *  A wakeup event is triggered from ADC2, write 1 to assert int enable.
 */
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TS    (BIT(5))
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TS_M  (RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TS_V << RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TS_S)
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TS_V  0x00000001U
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TS_S  5

/** RTCADC_INT_ENA_W1TC_REG register
 *  Interrupt enable deassert registers.
 */
#define RTCADC_INT_ENA_W1TC_REG (DR_REG_LP_ADC_BASE + 0x5c)
/** RTCADC_COCPU_SARADC1_INT_ENA_W1TC : WT; bitpos: [0]; default: 0;
 *  ADC1 Conversion is done, write 1 to deassert int enable.
 */
#define RTCADC_COCPU_SARADC1_INT_ENA_W1TC    (BIT(0))
#define RTCADC_COCPU_SARADC1_INT_ENA_W1TC_M  (RTCADC_COCPU_SARADC1_INT_ENA_W1TC_V << RTCADC_COCPU_SARADC1_INT_ENA_W1TC_S)
#define RTCADC_COCPU_SARADC1_INT_ENA_W1TC_V  0x00000001U
#define RTCADC_COCPU_SARADC1_INT_ENA_W1TC_S  0
/** RTCADC_COCPU_SARADC2_INT_ENA_W1TC : WT; bitpos: [1]; default: 0;
 *  ADC2 Conversion is done, write 1 to deassert int enable.
 */
#define RTCADC_COCPU_SARADC2_INT_ENA_W1TC    (BIT(1))
#define RTCADC_COCPU_SARADC2_INT_ENA_W1TC_M  (RTCADC_COCPU_SARADC2_INT_ENA_W1TC_V << RTCADC_COCPU_SARADC2_INT_ENA_W1TC_S)
#define RTCADC_COCPU_SARADC2_INT_ENA_W1TC_V  0x00000001U
#define RTCADC_COCPU_SARADC2_INT_ENA_W1TC_S  1
/** RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TC : WT; bitpos: [2]; default: 0;
 *  An errro occurs from ADC1, write 1 to deassert int enable.
 */
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TC    (BIT(2))
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TC_M  (RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TC_V << RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TC_S)
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TC_V  0x00000001U
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_W1TC_S  2
/** RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TC : WT; bitpos: [3]; default: 0;
 *  An errro occurs from ADC2, write 1 to deassert int enable.
 */
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TC    (BIT(3))
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TC_M  (RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TC_V << RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TC_S)
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TC_V  0x00000001U
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_W1TC_S  3
/** RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TC : WT; bitpos: [4]; default: 0;
 *  A wakeup event is triggered from ADC1, write 1 to deassert int enable.
 */
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TC    (BIT(4))
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TC_M  (RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TC_V << RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TC_S)
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TC_V  0x00000001U
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_W1TC_S  4
/** RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TC : WT; bitpos: [5]; default: 0;
 *  A wakeup event is triggered from ADC2, write 1 to deassert int enable.
 */
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TC    (BIT(5))
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TC_M  (RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TC_V << RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TC_S)
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TC_V  0x00000001U
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_W1TC_S  5

/** RTCADC_WAKEUP1_REG register
 *  ADC1 wakeup configuration registers.
 */
#define RTCADC_WAKEUP1_REG (DR_REG_LP_ADC_BASE + 0x60)
/** RTCADC_SAR1_WAKEUP_TH_LOW : R/W; bitpos: [11:0]; default: 0;
 *  Lower threshold.
 */
#define RTCADC_SAR1_WAKEUP_TH_LOW    0x00000FFFU
#define RTCADC_SAR1_WAKEUP_TH_LOW_M  (RTCADC_SAR1_WAKEUP_TH_LOW_V << RTCADC_SAR1_WAKEUP_TH_LOW_S)
#define RTCADC_SAR1_WAKEUP_TH_LOW_V  0x00000FFFU
#define RTCADC_SAR1_WAKEUP_TH_LOW_S  0
/** RTCADC_SAR1_WAKEUP_TH_HIGH : R/W; bitpos: [25:14]; default: 4095;
 *  Upper threshold.
 */
#define RTCADC_SAR1_WAKEUP_TH_HIGH    0x00000FFFU
#define RTCADC_SAR1_WAKEUP_TH_HIGH_M  (RTCADC_SAR1_WAKEUP_TH_HIGH_V << RTCADC_SAR1_WAKEUP_TH_HIGH_S)
#define RTCADC_SAR1_WAKEUP_TH_HIGH_V  0x00000FFFU
#define RTCADC_SAR1_WAKEUP_TH_HIGH_S  14
/** RTCADC_SAR1_WAKEUP_OVER_UPPER_TH : RO; bitpos: [29]; default: 0;
 *  Indicates that this wakeup event arose from exceeding upper threshold.
 */
#define RTCADC_SAR1_WAKEUP_OVER_UPPER_TH    (BIT(29))
#define RTCADC_SAR1_WAKEUP_OVER_UPPER_TH_M  (RTCADC_SAR1_WAKEUP_OVER_UPPER_TH_V << RTCADC_SAR1_WAKEUP_OVER_UPPER_TH_S)
#define RTCADC_SAR1_WAKEUP_OVER_UPPER_TH_V  0x00000001U
#define RTCADC_SAR1_WAKEUP_OVER_UPPER_TH_S  29
/** RTCADC_SAR1_WAKEUP_EN : R/W; bitpos: [30]; default: 0;
 *  Wakeup function enable.
 */
#define RTCADC_SAR1_WAKEUP_EN    (BIT(30))
#define RTCADC_SAR1_WAKEUP_EN_M  (RTCADC_SAR1_WAKEUP_EN_V << RTCADC_SAR1_WAKEUP_EN_S)
#define RTCADC_SAR1_WAKEUP_EN_V  0x00000001U
#define RTCADC_SAR1_WAKEUP_EN_S  30
/** RTCADC_SAR1_WAKEUP_MODE : R/W; bitpos: [31]; default: 0;
 *  0:absolute value comparison mode. 1: relative value comparison mode.
 */
#define RTCADC_SAR1_WAKEUP_MODE    (BIT(31))
#define RTCADC_SAR1_WAKEUP_MODE_M  (RTCADC_SAR1_WAKEUP_MODE_V << RTCADC_SAR1_WAKEUP_MODE_S)
#define RTCADC_SAR1_WAKEUP_MODE_V  0x00000001U
#define RTCADC_SAR1_WAKEUP_MODE_S  31

